{"chaitra": {"0": {"name": "Sheetala Ashtami ", "descript": " Sheetala Ashtami day, which is also known as Basoda Puja, is dedicated to Goddess Sheetala."}, "1": {"name": "Papmochani Ekadashi ", "descript": " Papmochini Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Ranga Panchami ", "descript": " At some places in India Holi is played on Ranga Panchami. Ranga Panchami usually falls after five days of Holi festivity in rest of the India."}, "3": {"name": "Ghatasthapana ", "descript": " Ghatasthapana is one of the significant rituals during Chaitra Navratri. It marks the beginning of nine days festivity."}, "4": {"name": "Ugadi ", "descript": " Ugadi marks the beginning of the New Year according to the lunisolar calendar. This festival is also known as Yugadi."}, "5": {"name": "Gudi Padwa ", "descript": " Gudi Padwa or Samvatsar Padvo is celebrated as the first day of the year by Maharashtrians and Konkanis."}, "6": {"name": "Gangaur ", "descript": " The consort of Lord Shiva, Gauri is worshipped during Gangaur festival. Both married and unmarried women worship Goddess Gauri on this day."}, "7": {"name": "Yamuna Chhath ", "descript": " Yamuna Chhath is celebrated as birth anniversary of Goddess Yamuna."}, "8": {"name": "Rama Navami ", "descript": " On Rama Navami day Hindus celebrate the birth of Lord Rama. On this day Lord Rama was born to King Dasharatha and Queen Kaushalya of Ayodhya."}, "9": {"name": "Kamada Ekadashi ", "descript": " Kamada Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "10": {"name": "Hanuman Jayanti ", "descript": " Hanuman Jayanti is celebrated to commemorate the birth of Hanuman, the Vanara god, widely venerated throughout India."}, "11": {"name": "Chaitra Purnima ", "descript": " Chaitra Purnima is the first Purnima in the year according to Hindu lunar calendar and it comes after Yugadi and Gudi Padwa."}}, "vaishakha": {"0": {"name": "Varuthini Ekadashi ", "descript": " Varuthini Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "1": {"name": "Parashurama Jayanti ", "descript": " Parashurama, the sixth avatar of Lord Vishnu, was born on this day. The birth of Lord Parashurama is celebrated as Parashurama Jayanti."}, "2": {"name": "Akshaya Tritiya ", "descript": " Akshaya Tritiya, also known as Akha Teej, is one of the most auspicious days. This day is ruled by god Vishnu, the preserver"}, "3": {"name": "Ganga Saptami ", "descript": " Ganga Saptami day is dedicated to Goddess Ganga. This day is also known as Ganga Pujan, Jahnu Saptami and Ganga Jayanti."}, "4": {"name": "Sita Navami ", "descript": " Sita Navami is celebrated as birth anniversary of Goddess Sita. This day is also known as Sita Jayanti."}, "5": {"name": "Mohini Ekadashi ", "descript": " Mohini Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "6": {"name": "Narasimha Jayanti ", "descript": " On Narasimha Jayanti day Lord Vishnu appeared in the form of Narasimha, a half lion and half man, to kill Demon Hiranyakashipu."}, "7": {"name": "Buddha Purnima ", "descript": " Gautama Buddha, on whose teachings Buddhism was founded, was born on Buddha Purnima day."}, "8": {"name": "Kurma Jayanti ", "descript": " Kurma Jayanti is the birth anniversary of Lord Vishnu. Kurma was the second incarnation of Lord Vishnu during Satya Yuga. Special Puja is organized in Lord Vishnu temples."}}, "jyeshtha": {"0": {"name": "Narada Jayanti ", "descript": " Narada Jayanti is celebrated as the birth anniversary of Devrishi Narada Muni."}, "1": {"name": "Apara Ekadashi ", "descript": " Apara Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Vat Savitri Vrat ", "descript": " Married women observe Vat Savitri Vrat for well"}, "3": {"name": "Shani Jayanti ", "descript": " Shani Jayanti is marked as birth anniversary of Lord Shani. Shani Jayanti is also known as Shani Amavasya."}, "4": {"name": "Ganga Dussehra ", "descript": " Gangavataran, the descent of the Goddess Ganga on the Earth, is celebrated on Ganga Dussehra day. Goddess, in form of river Ganga, is worshipped on this day."}, "5": {"name": "Nirjala Ekadashi ", "descript": " Nirjala Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "6": {"name": "Vat Purnima Vrat ", "descript": " Vat Purnima Vrat is similar to Vat Savitri Vrat. Married women observe Wat Purnima Vrat for well"}, "7": {"name": "Mahesh Navami ", "descript": " Mahesh Navami is observed annually on Shukla Paksha Navami in Jyeshtha month according to Hindu lunar calendar."}, "8": {"name": "Gayatri Jayanti ", "descript": " Jyeshtha Gayatri Jayanti"}}, "ashadha": {"0": {"name": "Yogini Ekadashi ", "descript": " Yogini Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "1": {"name": "Jagannath Rathyatra ", "descript": " Jagannath Rathyatra is a huge Hindu festival associated with Lord Jagannath held at Puri in the state of Orissa."}, "2": {"name": "Devshayani Ekadashi ", "descript": " Devshayani Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "3": {"name": "Guru Purnima ", "descript": " Guru Purnima is a festival traditionally celebrated by Hindus. On this day, disciples offer puja or pay respect to their Guru."}, "4": {"name": "Gauri Vrat Begins ", "descript": " Gauri Vrat is significant fasting period dedicated to Goddess Parvati. This Gauri Vrat is mainly observed in Gujarat."}, "5": {"name": "Jayaparvati Vrat Begins ", "descript": " Jayaparvati Vrat is significant fasting period dedicated to Goddess Jaya, a form of Goddess Parvati. Jayaparvati Vrat is mainly observed in Gujarat."}, "6": {"name": "Kokila Vrat ", "descript": " Kokila Vrat is dedicated to Goddess Sati and Lord Shiva. The name Kokila refers to Indian bird cuckoo and is associated with Goddess Sati."}, "7": {"name": "Vyasa Puja ", "descript": " Full moon day during Ashadha month is known as Vyasa Puja day. Traditionally this day is reserved for Guru Puja or Guru Worship."}}, "shravana": {"0": {"name": "Kamika Ekadashi ", "descript": " Kamika Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "1": {"name": "Shravan Somwar Vrats ", "descript": " All Mondays or Somwar(s) which fall during Shravan month are considered highly auspicious for fasting and known as Shravan Somwar."}, "2": {"name": "Mangala Gauri Vrats ", "descript": " Mangala Gauri Vrat is observed by married women on each Tuesday in Hindu month of Shravana to seek conjugal bliss from Goddess Gauri."}, "3": {"name": "Hariyali Teej ", "descript": " Hariyali Teej commemorates union of Goddess Parvati with Lord Shiva. This festival is celebrated for marital bliss and well"}, "4": {"name": "Nag Panchami ", "descript": " On Nag Panchami day married women offer puja and milk to Snake God and women pray for the wellness of their brothers and family."}, "5": {"name": "Shravana Putrada Ekadashi ", "descript": " Shravana Putrada Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "6": {"name": "Varalakshmi Vrat ", "descript": " Varalakshmi Vratam is a festival to propitiate the goddess Lakshmi, the consort of Lord Vishnu."}, "7": {"name": "Raksha Bandhan ", "descript": " The relationship between brothers and sisters is celebrated during Raksha Bandhan festival. It involves sisters tying a sacred thread around brothers' wrist."}, "8": {"name": "Gayatri Jayanti ", "descript": " Gayatri Jayanti is observed as the birth anniversary of Goddess Gayatri, the Goddess of Veda."}, "9": {"name": "Kalki Jayanti ", "descript": " Kalki Jayanti is the birth anniversary of Lord Vishnu in coming future. Kalki would be the tenth and the last incarnation of Lord Vishnu at the end of Kali Yuga."}, "10": {"name": "Hayagriva Jayanti ", "descript": " Hayagriva Jayanti is the birth anniversary of Lord Hayagriva who is considered the incarnation of Lord Vishnu."}, "11": {"name": "Narali Purnima ", "descript": " Shravana Purnima is popularly known as Narali Purnima in Maharashtra, especially at coastal Maharashtra and Konkani region."}, "12": {"name": "Sanskrit Diwas ", "descript": " Sanskrit Diwas is celebrated to mark the importance of Sanskrit language, the mother of all Indian languages and the first among the ancient languages spoken in India."}}, "bhadrapada": {"0": {"name": "Kajari Teej ", "descript": " Next Teej after Hariyali Teej which comes after fifteen days of Hariyali Teej is known as Kajari Teej."}, "1": {"name": "Krishna Janmashtami ", "descript": " Krishna Janmashtami is a festival commemorating the birth of Lord Krishna. Lord Krishna was the eighth incarnation of Vishnu's Dashavatara."}, "2": {"name": "Aja Ekadashi ", "descript": " Aja Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "3": {"name": "Dahi Handi ", "descript": " Dahi Handi is a famous sportive event organized in the cities of Maharashtra and Goa. Dahi Handi is celebrated on the next day of Krishna Janmashtami."}, "4": {"name": "Gayatri Japam ", "descript": " Gayatri Japam day is linked with Upakarma day and it is observed on the next of Shravani Upakarma day."}, "5": {"name": "Hartalika Teej ", "descript": " Haritalika Teej comes one month after Hariyali Teej and most of the time celebrated one day before Ganesh Chaturthi."}, "6": {"name": "Ganesh Chaturthi ", "descript": " On Ganesh Chaturthi devotees worship Lord Ganesha. Lord Ganesha is worshipped as the god of wisdom, prosperity and good fortune."}, "7": {"name": "Rishi Panchami ", "descript": " Rishi Panchami is not a festival but a fasting day observed by women to pay obeisance to the Sapta Rishis and to get purified from Rajaswala Dosha."}, "8": {"name": "Radha Ashtami ", "descript": " Radha Ashtami celebrates the birth of Radha, who was the consort of the Lord Krishna during the period of his life when he lived among the cowherds of Vrindavana."}, "9": {"name": "Parsva Ekadashi ", "descript": " Parivartini Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "10": {"name": "Ganesh Visarjan ", "descript": " On Ganesh Visarjan day the idol of Ganesha is immersed in water body, usually in lakes or ponds after a large procession."}, "11": {"name": "Vamana Jayanti ", "descript": " Vamana Jayanti is the birth anniversary of Lord Vishnu. Vamana was the fifth incarnation of Lord Vishnu during Treta Yuga."}, "12": {"name": "Mahalakshmi Vrat Begins ", "descript": " Mahalakshmi Vrat begins on Shukla Ashtami during Bhadrapada month which comes after four days of Ganesha Chaturthi."}, "13": {"name": "Anant Chaturdashi ", "descript": " Anant Chaturdashi is the most significant day to worship Lord Vishnu in Anant form. On this day devotees of Lord Vishnu observe a day long fast and tie sacred thread during Puja."}, "14": {"name": "Durva Ashtami ", "descript": " Durvashtami Vrat is observed during Shukla Paksha Ashtami in the month of Bhadrapada. Durva Ashtami Vrat is mainly observed by women."}}, "ashwin": {"0": {"name": "Pitrupaksha Begins ", "descript": " First day of Pitru Paksha marks the beginning of the period when Hindus pay homage to their ancestors (Pitrs), especially through food offerings.I"}, "1": {"name": "Indira Ekadashi ", "descript": " Indira Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Sarva Pitru Amavasya ", "descript": " This is the most significant and last day of Pitru Paksha. This day is also known as Sarvapitri Amavasya or Mahalaya Amavasya."}, "3": {"name": "Jivitputrika Vrat ", "descript": " Jivitputrika Vrat is a significant fasting day in which mothers observe Nirjala fasting throughout the day and night for well"}, "4": {"name": "Shardiya Navratri ", "descript": " Shardiya Navratri is the most popular and significant Navratri of all Navratris. That's why Shardiya Navratri is also known as Maha Navratri."}, "5": {"name": "Saraswati Avahan ", "descript": " The first day of Saraswati Puja during Navratri Puja is known as Saraswati Avahan. Avahan means invocation of Goddess Saraswati."}, "6": {"name": "Saraswati Puja ", "descript": " The second day of Saraswati Puja during Navratri Puja is known as Saraswati Pradhan Puja day."}, "7": {"name": "Durga Ashtami ", "descript": " Durga Ashtami, also known as Maha Ashtami, is one of the most auspicious days of the Durga Puja festival."}, "8": {"name": "Maha Navami ", "descript": " Maha Navami is the concluding day of nine days Durga Puja festivity. The main Navami Puja begins after the end of Sandhi Puja."}, "9": {"name": "Dussehra ", "descript": " Vijayadashami or Dussehra is celebrated as victory of Lord Rama over Demon Ravana and also triumph of Goddess Durga over the buffalo Demon Mahishasura."}, "10": {"name": "Papankusha Ekadashi ", "descript": " Papankusha Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "11": {"name": "Sharad Purnima ", "descript": " It is believed that Sharad Purnima is the only day in the year when the moon comes out with all sixteen Kala(s)."}, "12": {"name": "Upang Lalita Vrat ", "descript": " Lalita Panchami is a fasting day for Goddess Lalita and also known as Upang Lalita Vrat."}, "13": {"name": "Kojagara Puja ", "descript": " Lakshmi Puja on Purnima Tithi in month of Ashwin is known as Kojagara Puja and more commonly known as Bengal Lakshmi Puja."}}, "kartik": {"0": {"name": "Karwa Chauth ", "descript": " Karwa Chauth is a one day festival in which married women fast from sunrise to moonrise seeking the well"}, "1": {"name": "Ahoi Ashtami ", "descript": " Ahoi Ashtami is a festival celebrated in North India in which mothers hold a fast from dawn to dusk for the well"}, "2": {"name": "Rama Ekadashi ", "descript": " Rama Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "3": {"name": "Dhanteras ", "descript": " Dhanteras, which is also known as Dhantrayodashi, is the first day of five days Diwali festivity. On this day Goddess Lakshmi is worshipped with God Kuber."}, "4": {"name": "Narak Chaturdashi ", "descript": " Narak Chaturdashi is celebrated as victory of Lord Krishna over Demon Narakasura. This day is also known as Kali Chaudas and Roop Chaudas."}, "5": {"name": "Lakshmi Puja ", "descript": " Lakshmi puja is performed during five days Diwali festivity. Lakshmi puja is the most important day of five days festivity."}, "6": {"name": "Govardhan Puja ", "descript": " The day, when Lord Krishna defeated Indra, is celebrated as Govardhan Puja or Annakut Puja. This day is also celebrated as Bali Pratipada and New Year day."}, "7": {"name": "Bhaiya Dooj ", "descript": " On Bhaiya Duj, sisters pray for their brothers to have long and happy lives by performing Teeka ceremony and brothers offer gifts to their sisters."}, "8": {"name": "Chhath Puja ", "descript": " The Sun God, Surya, the god of energy and of the life"}, "9": {"name": "Gopashtami ", "descript": " Gopashtami day falls on Ashtami Tithi during Kartik Shukla Paksha. It is famous festival in Mathura, Vrindavan and other Braj areas."}, "10": {"name": "Kansa Vadh ", "descript": " On Kansa Vadha day Kansa was killed by Lord Krishna and Ugrasena reinstated as King of Mathura."}, "11": {"name": "Devutthana Ekadashi ", "descript": " Devutthana Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "12": {"name": "Tulasi Vivah ", "descript": " Tulsi Vivah is the ceremonial marriage of the Tulsi plant (holy basil) to the Hindu god Vishnu or his Avatar Krishna."}}, "margashirsha": {"0": {"name": "Kalabhairav Jayanti ", "descript": " Kalabhairav Jayanti is the birth anniversary of fierce manifestation of Lord Shiva associated with annihilation."}, "1": {"name": "Utpanna Ekadashi ", "descript": " Utpanna Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Vivah Panchami ", "descript": " On Vivah Panchami day Lord Rama and Goddess Sita were married and this day is celebrated as marriage anniversary of Rama and Sita."}, "3": {"name": "Gita Jayanti ", "descript": " Gita Jayanti day symbolizes the birth of Srimad Bhagavad"}, "4": {"name": "Mokshada Ekadashi ", "descript": " Mokshada Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "5": {"name": "Dattatreya Jayanti ", "descript": " Dattatreya Jayanti is the birth anniversary of Hindu deity encompassing the trinity of Brahma, Vishnu and Shiva, collectively known as Trimurti."}, "6": {"name": "Annapurna Jayanti ", "descript": " Annapurna Jayanti is observed annually on Purnima in the month of Margashirsha as per Hindu lunar calendar."}}, "paush": {"0": {"name": "Saphala Ekadashi ", "descript": " Saphala Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "1": {"name": "Pausha Putrada Ekadashi ", "descript": " Pausha Putrada Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Banada Ashtami ", "descript": " Banada Ashtami begins on Paush Shukla Ashtami and ends on Paush Purnima. Paush Shukla Ashtami is known as Banada Ashtami."}, "3": {"name": "Shakambhari Purnima ", "descript": " Shakambhari Purnima which is also known as Shakambari Jayanti, is the last day of Shakambari Navratri."}, "4": {"name": "Pausha Purnima ", "descript": " Paush Purnima is a significant day in Hindu calendar. It marks the beginning of one month long austerity period which is observed during Magha month."}}, "magha": {"0": {"name": "Sakat Chauth ", "descript": " On Sakat Chauth, also known as Sankashta Chaturti, Lord Ganesha is worshipped. Worshipping Lord Ganesha on this day brings happiness and prosperity."}, "1": {"name": "Shattila Ekadashi ", "descript": " Shattila Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "2": {"name": "Vasant Panchami ", "descript": " Saraswati, the Goddess of knowledge, music and art, is worshipped on Vasant Panchami day. Yellow flowers are offered to Maa Saraswati on this day."}, "3": {"name": "Ratha Saptami ", "descript": " Saptami Tithi is dedicated to Lord Surya. It is believed that Lord Surya Dev started enlightening the whole world on Ratha Saptami day."}, "4": {"name": "Bhishma Ashtami ", "descript": " Magha Shukla Ashtami is death anniversary of Bhishma Pitamah and this day is known as Bhishma Ashtmai."}, "5": {"name": "Jaya Ekadashi ", "descript": " Jaya Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}}, "phalguna": {"0": {"name": "Vijaya Ekadashi ", "descript": " Vijaya Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "1": {"name": "Maha Shivaratri ", "descript": " Lord Shiva is worshipped on Maha Shivratri day. It is believed that Lord Shiva was born as Linga at midnight on this day."}, "2": {"name": "Phulera Dooj ", "descript": " Phulera Dooj is marked on Shukla Paksha Dwitiya in the month of Phagun in Hindu calendar."}, "3": {"name": "Amalaki Ekadashi ", "descript": " Amalaki Ekadashi is one of the twenty four Ekadashi vrats which are observed to seek blessing of Lord Vishnu."}, "4": {"name": "Holika Dahan ", "descript": " On the eve of Holika Dahan huge bonfires are lit to commemorate the burning of the Demoness Holika, the sister of Demon Hiranyakashipu."}, "5": {"name": "Holi ", "descript": " Holi is also known as the festival of colours. On this day people throw coloured powder and coloured water on each other."}}}